// Задача 1: Задайте значения M и N. Напишите
// программу, которая выведет все натуральные числа
// в промежутке от M до N. Использовать рекурсию, не
// использовать циклы.

Console.WriteLine("Введите значение M: ");
int mValue = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите значение N: ");
int nValue = int.Parse(Console.ReadLine()!);
